Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32C_1.xml
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="UART_MR__OPT_DUTY">
        <value caption="Modulation clock duty cycle Is 50%." name="DUTY_50" value="0x0"/>
        <value caption="Modulation clock duty cycle Is 43.75%." name="DUTY_43P75" value="0x1"/>
        <value caption="Modulation clock duty cycle Is 37.5%." name="DUTY_37P5" value="0x2"/>
        <value caption="Modulation clock duty cycle Is 31.75%." name="DUTY_31P25" value="0x3"/>
        <value caption="Modulation clock duty cycle Is 25%." name="DUTY_25" value="0x4"/>
        <value caption="Modulation clock duty cycle Is 18.75%." name="DUTY_18P75" value="0x5"/>
        <value caption="Modulation clock duty cycle Is 12.5%." name="DUTY_12P5" value="0x6"/>
        <value caption="Modulation clock duty cycle Is 6.25%." name="DUTY_6P25" value="0x7"/>
      </value-group>
      <value-group caption="" name="UART_MR__OPT_CMPTH">
        <value caption="Comparator threshold is VDDIO/2 Volts." name="VDDIO_DIV2" value="0x0"/>
        <value caption="Comparator threshold is VDDIO/2.5 Volts." name="VDDIO_DIV2P5" value="0x1"/>
        <value caption="Comparator threshold is VDDIO/3.3 Volts." name="VDDIO_DIV3P3" value="0x2"/>
        <value caption="Comparator threshold is VDDIO/5 Volts." name="VDDIO_DIV5" value="0x3"/>
        <value caption="Comparator threshold is VDDIO/10 Volts." name="VDDIO_DIV10" value="0x4"/>
      </value-group>
    </module>
    <module caption="USB On-The-Go Interface" name="UOTGHS" version="11016C">
      <register-group name="UOTGHS">
        <register caption="Device General Control Register" name="UOTGHS_DEVCTRL" offset="0x0000" rw="RW" size="4">
          <bitfield caption="USB Address" mask="0x0000007F" name="UADD"/>
          <bitfield caption="Address Enable" mask="0x00000080" name="ADDEN"/>
          <bitfield caption="Detach" mask="0x00000100" name="DETACH"/>
          <bitfield caption="Remote Wake-Up" mask="0x00000200" name="RMWKUP"/>
          <bitfield caption="Low-Speed Mode Force" mask="0x00001000" name="LS"/>
        </register>
        <register caption="Device Global Interrupt Status Register" name="UOTGHS_DEVISR" offset="0x0004" rw="R" size="4">
          <bitfield caption="Suspend Interrupt" mask="0x00000001" name="SUSP"/>
          <bitfield caption="Start of Frame Interrupt" mask="0x00000004" name="SOF"/>
          <bitfield caption="End of Reset Interrupt" mask="0x00000008" name="EORST"/>
          <bitfield caption="Wake-Up Interrupt" mask="0x00000010" name="WAKEUP"/>
          <bitfield caption="End of Resume Interrupt" mask="0x00000020" name="EORSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000040" name="UPRSM"/>
          <bitfield caption="Endpoint 0 Interrupt" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Device Global Interrupt Clear Register" name="UOTGHS_DEVICR" offset="0x0008" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000001" name="SUSPC"/>
          <bitfield caption="Start of Frame Interrupt Clear" mask="0x00000004" name="SOFC"/>
          <bitfield caption="End of Reset Interrupt Clear" mask="0x00000008" name="EORSTC"/>
          <bitfield caption="Wake-Up Interrupt Clear" mask="0x00000010" name="WAKEUPC"/>
          <bitfield caption="End of Resume Interrupt Clear" mask="0x00000020" name="EORSMC"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000040" name="UPRSMC"/>
        </register>
        <register caption="Device Global Interrupt Set Register" name="UOTGHS_DEVIFR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Set" mask="0x00000001" name="SUSPS"/>
          <bitfield caption="Start of Frame Interrupt Set" mask="0x00000004" name="SOFS"/>
          <bitfield caption="End of Reset Interrupt Set" mask="0x00000008" name="EORSTS"/>
          <bitfield caption="Wake-Up Interrupt Set" mask="0x00000010" name="WAKEUPS"/>
          <bitfield caption="End of Resume Interrupt Set" mask="0x00000020" name="EORSMS"/>
          <bitfield caption="Upstream Resume Interrupt Set" mask="0x00000040" name="UPRSMS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Device Global Interrupt Mask Register" name="UOTGHS_DEVIMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Suspend Interrupt Mask" mask="0x00000001" name="SUSPE"/>
          <bitfield caption="Start of Frame Interrupt Mask" mask="0x00000004" name="SOFE"/>
          <bitfield caption="End of Reset Interrupt Mask" mask="0x00000008" name="EORSTE"/>
          <bitfield caption="Wake-Up Interrupt Mask" mask="0x00000010" name="WAKEUPE"/>
          <bitfield caption="End of Resume Interrupt Mask" mask="0x00000020" name="EORSME"/>
          <bitfield caption="Upstream Resume Interrupt Mask" mask="0x00000040" name="UPRSME"/>
          <bitfield caption="Endpoint 0 Interrupt Mask" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Mask" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Mask" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Mask" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Mask" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Mask" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Mask" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Mask" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Mask" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Device Global Interrupt Disable Register" name="UOTGHS_DEVIDR" offset="0x0014" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Disable" mask="0x00000001" name="SUSPEC"/>
          <bitfield caption="Start of Frame Interrupt Disable" mask="0x00000004" name="SOFEC"/>
          <bitfield caption="End of Reset Interrupt Disable" mask="0x00000008" name="EORSTEC"/>
          <bitfield caption="Wake-Up Interrupt Disable" mask="0x00000010" name="WAKEUPEC"/>
          <bitfield caption="End of Resume Interrupt Disable" mask="0x00000020" name="EORSMEC"/>
          <bitfield caption="Upstream Resume Interrupt Disable" mask="0x00000040" name="UPRSMEC"/>
          <bitfield caption="Endpoint 0 Interrupt Disable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Disable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Disable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Disable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Disable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Disable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Disable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Disable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Disable" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Device Global Interrupt Enable Register" name="UOTGHS_DEVIER" offset="0x0018" rw="W" size="4">
          <bitfield caption="Suspend Interrupt Enable" mask="0x00000001" name="SUSPES"/>
          <bitfield caption="Start of Frame Interrupt Enable" mask="0x00000004" name="SOFES"/>
          <bitfield caption="End of Reset Interrupt Enable" mask="0x00000008" name="EORSTES"/>
          <bitfield caption="Wake-Up Interrupt Enable" mask="0x00000010" name="WAKEUPES"/>
          <bitfield caption="End of Resume Interrupt Enable" mask="0x00000020" name="EORSMES"/>
          <bitfield caption="Upstream Resume Interrupt Enable" mask="0x00000040" name="UPRSMES"/>
          <bitfield caption="Endpoint 0 Interrupt Enable" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt Enable" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt Enable" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt Enable" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt Enable" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Device Endpoint Register" name="UOTGHS_DEVEPT" offset="0x001C" rw="RW" size="4">
          <bitfield caption="Endpoint 0 Enable" mask="0x00000001" name="EPEN0"/>
          <bitfield caption="Endpoint 1 Enable" mask="0x00000002" name="EPEN1"/>
          <bitfield caption="Endpoint 2 Enable" mask="0x00000004" name="EPEN2"/>
          <bitfield caption="Endpoint 3 Enable" mask="0x00000008" name="EPEN3"/>
          <bitfield caption="Endpoint 4 Enable" mask="0x00000010" name="EPEN4"/>
          <bitfield caption="Endpoint 5 Enable" mask="0x00000020" name="EPEN5"/>
          <bitfield caption="Endpoint 6 Enable" mask="0x00000040" name="EPEN6"/>
          <bitfield caption="Endpoint 7 Enable" mask="0x00000080" name="EPEN7"/>
          <bitfield caption="Endpoint 8 Enable" mask="0x00000100" name="EPEN8"/>
          <bitfield caption="Endpoint 0 Reset" mask="0x00010000" name="EPRST0"/>
          <bitfield caption="Endpoint 1 Reset" mask="0x00020000" name="EPRST1"/>
          <bitfield caption="Endpoint 2 Reset" mask="0x00040000" name="EPRST2"/>
          <bitfield caption="Endpoint 3 Reset" mask="0x00080000" name="EPRST3"/>
          <bitfield caption="Endpoint 4 Reset" mask="0x00100000" name="EPRST4"/>
          <bitfield caption="Endpoint 5 Reset" mask="0x00200000" name="EPRST5"/>
          <bitfield caption="Endpoint 6 Reset" mask="0x00400000" name="EPRST6"/>
          <bitfield caption="Endpoint 7 Reset" mask="0x00800000" name="EPRST7"/>
          <bitfield caption="Endpoint 8 Reset" mask="0x01000000" name="EPRST8"/>
        </register>
        <register caption="Device Frame Number Register" name="UOTGHS_DEVFNUM" offset="0x0020" rw="R" size="4">
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Number CRC Error" mask="0x00008000" name="FNCERR"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 0" name="UOTGHS_DEVEPTCFG0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 1" name="UOTGHS_DEVEPTCFG1" offset="0x104" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 2" name="UOTGHS_DEVEPTCFG2" offset="0x108" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 3" name="UOTGHS_DEVEPTCFG3" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
        </register>
        <register caption="Device Endpoint Configuration Register (n = 0) 4" name="UOTGHS_DEVEPTCFG4" offset="0x110" rw="RW" size="4">
          <bitfield caption="Endpoint Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Endpoint Banks" mask="0x0000000C" name="EPBK" values="UOTGHS_DEVEPTCFG__EPBK"/>
          <bitfield caption="Endpoint Size" mask="0x00000070" name="EPSIZE" values="UOTGHS_DEVEPTCFG__EPSIZE"/>
          <bitfield caption="Endpoint Direction" mask="0x00000100" name="EPDIR" values="UOTGHS_DEVEPTCFG__EPDIR"/>
          <bitfield caption="Automatic Switch" mask="0x00000200" name="AUTOSW"/>
          <bitfield caption="Endpoint Type" mask="0x00001800" name="EPTYPE" values="UOTGHS_DEVEPTCFG__EPTYPE"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 0" name="UOTGHS_DEVEPTISR0" offset="0x130" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 1" name="UOTGHS_DEVEPTISR1" offset="0x134" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
