Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32C_1.xml
        <register caption="Device Endpoint Status Register (n = 0) 2" name="UOTGHS_DEVEPTISR2" offset="0x138" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 3" name="UOTGHS_DEVEPTISR3" offset="0x13C" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Status Register (n = 0) 4" name="UOTGHS_DEVEPTISR4" offset="0x140" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINI"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTI"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPI"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTI"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKET"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="UOTGHS_DEVEPTISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="UOTGHS_DEVEPTISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="UOTGHS_DEVEPTISR__CURRBK"/>
          <bitfield caption="Read-write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Control Direction" mask="0x00020000" name="CTRLDIR"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Byte Count" mask="0x7FF00000" name="BYCT"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 0" name="UOTGHS_DEVEPTICR0" offset="0x160" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 1" name="UOTGHS_DEVEPTICR1" offset="0x164" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 2" name="UOTGHS_DEVEPTICR2" offset="0x168" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 3" name="UOTGHS_DEVEPTICR3" offset="0x16C" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Clear Register (n = 0) 4" name="UOTGHS_DEVEPTICR4" offset="0x170" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Clear" mask="0x00000001" name="TXINIC"/>
          <bitfield caption="Received OUT Data Interrupt Clear" mask="0x00000002" name="RXOUTIC"/>
          <bitfield caption="Received SETUP Interrupt Clear" mask="0x00000004" name="RXSTPIC"/>
          <bitfield caption="NAKed OUT Interrupt Clear" mask="0x00000008" name="NAKOUTIC"/>
          <bitfield caption="NAKed IN Interrupt Clear" mask="0x00000010" name="NAKINIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield caption="STALLed Interrupt Clear" mask="0x00000040" name="STALLEDIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETC"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 0" name="UOTGHS_DEVEPTIFR0" offset="0x190" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 1" name="UOTGHS_DEVEPTIFR1" offset="0x194" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
