Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4C32C_1.xml
        <register caption="Device DMA Channel Control Register (n = 3)" name="UOTGHS_DEVDMACONTROL3" offset="0x338" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 3)" name="UOTGHS_DEVDMASTATUS3" offset="0x33C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Device DMA Channel Next Descriptor Address Register (n = 4)" name="UOTGHS_DEVDMANXTDSC4" offset="0x340" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Device DMA Channel Address Register (n = 4)" name="UOTGHS_DEVDMAADDRESS4" offset="0x344" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Device DMA Channel Control Register (n = 4)" name="UOTGHS_DEVDMACONTROL4" offset="0x348" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 4)" name="UOTGHS_DEVDMASTATUS4" offset="0x34C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
        <register caption="Host General Control Register" name="UOTGHS_HSTCTRL" offset="0x0400" rw="RW" size="4">
          <bitfield caption="Start of Frame Generation Enable" mask="0x00000100" name="SOFE"/>
          <bitfield caption="Send USB Reset" mask="0x00000200" name="RESET"/>
          <bitfield caption="Send USB Resume" mask="0x00000400" name="RESUME"/>
        </register>
        <register caption="Host Global Interrupt Status Register" name="UOTGHS_HSTISR" offset="0x0404" rw="R" size="4">
          <bitfield caption="Device Connection Interrupt" mask="0x00000001" name="DCONNI"/>
          <bitfield caption="Device Disconnection Interrupt" mask="0x00000002" name="DDISCI"/>
          <bitfield caption="USB Reset Sent Interrupt" mask="0x00000004" name="RSTI"/>
          <bitfield caption="Downstream Resume Sent Interrupt" mask="0x00000008" name="RSMEDI"/>
          <bitfield caption="Upstream Resume Received Interrupt" mask="0x00000010" name="RXRSMI"/>
          <bitfield caption="Host Start of Frame Interrupt" mask="0x00000020" name="HSOFI"/>
          <bitfield caption="Host Wake-Up Interrupt" mask="0x00000040" name="HWUPI"/>
          <bitfield caption="Pipe 0 Interrupt" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Host Global Interrupt Clear Register" name="UOTGHS_HSTICR" offset="0x0408" rw="W" size="4">
          <bitfield caption="Device Connection Interrupt Clear" mask="0x00000001" name="DCONNIC"/>
          <bitfield caption="Device Disconnection Interrupt Clear" mask="0x00000002" name="DDISCIC"/>
          <bitfield caption="USB Reset Sent Interrupt Clear" mask="0x00000004" name="RSTIC"/>
          <bitfield caption="Downstream Resume Sent Interrupt Clear" mask="0x00000008" name="RSMEDIC"/>
          <bitfield caption="Upstream Resume Received Interrupt Clear" mask="0x00000010" name="RXRSMIC"/>
          <bitfield caption="Host Start of Frame Interrupt Clear" mask="0x00000020" name="HSOFIC"/>
          <bitfield caption="Host Wake-Up Interrupt Clear" mask="0x00000040" name="HWUPIC"/>
        </register>
        <register caption="Host Global Interrupt Set Register" name="UOTGHS_HSTIFR" offset="0x040C" rw="W" size="4">
          <bitfield caption="Device Connection Interrupt Set" mask="0x00000001" name="DCONNIS"/>
          <bitfield caption="Device Disconnection Interrupt Set" mask="0x00000002" name="DDISCIS"/>
          <bitfield caption="USB Reset Sent Interrupt Set" mask="0x00000004" name="RSTIS"/>
          <bitfield caption="Downstream Resume Sent Interrupt Set" mask="0x00000008" name="RSMEDIS"/>
          <bitfield caption="Upstream Resume Received Interrupt Set" mask="0x00000010" name="RXRSMIS"/>
          <bitfield caption="Host Start of Frame Interrupt Set" mask="0x00000020" name="HSOFIS"/>
          <bitfield caption="Host Wake-Up Interrupt Set" mask="0x00000040" name="HWUPIS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Host Global Interrupt Mask Register" name="UOTGHS_HSTIMR" offset="0x0410" rw="R" size="4">
          <bitfield caption="Device Connection Interrupt Enable" mask="0x00000001" name="DCONNIE"/>
          <bitfield caption="Device Disconnection Interrupt Enable" mask="0x00000002" name="DDISCIE"/>
          <bitfield caption="USB Reset Sent Interrupt Enable" mask="0x00000004" name="RSTIE"/>
          <bitfield caption="Downstream Resume Sent Interrupt Enable" mask="0x00000008" name="RSMEDIE"/>
          <bitfield caption="Upstream Resume Received Interrupt Enable" mask="0x00000010" name="RXRSMIE"/>
          <bitfield caption="Host Start of Frame Interrupt Enable" mask="0x00000020" name="HSOFIE"/>
          <bitfield caption="Host Wake-Up Interrupt Enable" mask="0x00000040" name="HWUPIE"/>
          <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Host Global Interrupt Disable Register" name="UOTGHS_HSTIDR" offset="0x0414" rw="W" size="4">
          <bitfield caption="Device Connection Interrupt Disable" mask="0x00000001" name="DCONNIEC"/>
          <bitfield caption="Device Disconnection Interrupt Disable" mask="0x00000002" name="DDISCIEC"/>
          <bitfield caption="USB Reset Sent Interrupt Disable" mask="0x00000004" name="RSTIEC"/>
          <bitfield caption="Downstream Resume Sent Interrupt Disable" mask="0x00000008" name="RSMEDIEC"/>
          <bitfield caption="Upstream Resume Received Interrupt Disable" mask="0x00000010" name="RXRSMIEC"/>
          <bitfield caption="Host Start of Frame Interrupt Disable" mask="0x00000020" name="HSOFIEC"/>
          <bitfield caption="Host Wake-Up Interrupt Disable" mask="0x00000040" name="HWUPIEC"/>
          <bitfield caption="Pipe 0 Interrupt Disable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Disable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Disable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Disable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Disable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Disable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Disable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Disable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Disable" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Host Global Interrupt Enable Register" name="UOTGHS_HSTIER" offset="0x0418" rw="W" size="4">
          <bitfield caption="Device Connection Interrupt Enable" mask="0x00000001" name="DCONNIES"/>
          <bitfield caption="Device Disconnection Interrupt Enable" mask="0x00000002" name="DDISCIES"/>
          <bitfield caption="USB Reset Sent Interrupt Enable" mask="0x00000004" name="RSTIES"/>
          <bitfield caption="Downstream Resume Sent Interrupt Enable" mask="0x00000008" name="RSMEDIES"/>
          <bitfield caption="Upstream Resume Received Interrupt Enable" mask="0x00000010" name="RXRSMIES"/>
          <bitfield caption="Host Start of Frame Interrupt Enable" mask="0x00000020" name="HSOFIES"/>
          <bitfield caption="Host Wake-Up Interrupt Enable" mask="0x00000040" name="HWUPIES"/>
          <bitfield caption="Pipe 0 Interrupt Enable" mask="0x00000100" name="PEP_0"/>
          <bitfield caption="Pipe 1 Interrupt Enable" mask="0x00000200" name="PEP_1"/>
          <bitfield caption="Pipe 2 Interrupt Enable" mask="0x00000400" name="PEP_2"/>
          <bitfield caption="Pipe 3 Interrupt Enable" mask="0x00000800" name="PEP_3"/>
          <bitfield caption="Pipe 4 Interrupt Enable" mask="0x00001000" name="PEP_4"/>
          <bitfield caption="DMA Channel 1 Interrupt Enable" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Enable" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Enable" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Enable" mask="0x10000000" name="DMA_4"/>
        </register>
        <register caption="Host Pipe Register" name="UOTGHS_HSTPIP" offset="0x0041C" rw="RW" size="4">
          <bitfield caption="Pipe 0 Enable" mask="0x00000001" name="PEN0"/>
          <bitfield caption="Pipe 1 Enable" mask="0x00000002" name="PEN1"/>
          <bitfield caption="Pipe 2 Enable" mask="0x00000004" name="PEN2"/>
          <bitfield caption="Pipe 3 Enable" mask="0x00000008" name="PEN3"/>
          <bitfield caption="Pipe 4 Enable" mask="0x00000010" name="PEN4"/>
          <bitfield caption="Pipe 5 Enable" mask="0x00000020" name="PEN5"/>
          <bitfield caption="Pipe 6 Enable" mask="0x00000040" name="PEN6"/>
          <bitfield caption="Pipe 7 Enable" mask="0x00000080" name="PEN7"/>
          <bitfield caption="Pipe 8 Enable" mask="0x00000100" name="PEN8"/>
          <bitfield caption="Pipe 0 Reset" mask="0x00010000" name="PRST0"/>
          <bitfield caption="Pipe 1 Reset" mask="0x00020000" name="PRST1"/>
          <bitfield caption="Pipe 2 Reset" mask="0x00040000" name="PRST2"/>
          <bitfield caption="Pipe 3 Reset" mask="0x00080000" name="PRST3"/>
          <bitfield caption="Pipe 4 Reset" mask="0x00100000" name="PRST4"/>
          <bitfield caption="Pipe 5 Reset" mask="0x00200000" name="PRST5"/>
          <bitfield caption="Pipe 6 Reset" mask="0x00400000" name="PRST6"/>
          <bitfield caption="Pipe 7 Reset" mask="0x00800000" name="PRST7"/>
          <bitfield caption="Pipe 8 Reset" mask="0x01000000" name="PRST8"/>
        </register>
        <register caption="Host Frame Number Register" name="UOTGHS_HSTFNUM" offset="0x0420" rw="RW" size="4">
          <bitfield caption="Frame Number" mask="0x00003FF8" name="FNUM"/>
          <bitfield caption="Frame Length" mask="0x00FF0000" name="FLENHIGH"/>
        </register>
        <register caption="Host Address 1 Register" name="UOTGHS_HSTADDR1" offset="0x0424" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP0"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP1"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP2"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP3"/>
        </register>
        <register caption="Host Address 2 Register" name="UOTGHS_HSTADDR2" offset="0x0428" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP4"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP5"/>
          <bitfield caption="USB Host Address" mask="0x007F0000" name="HSTADDRP6"/>
          <bitfield caption="USB Host Address" mask="0x7F000000" name="HSTADDRP7"/>
        </register>
        <register caption="Host Address 3 Register" name="UOTGHS_HSTADDR3" offset="0x042C" rw="RW" size="4">
          <bitfield caption="USB Host Address" mask="0x0000007F" name="HSTADDRP8"/>
          <bitfield caption="USB Host Address" mask="0x00007F00" name="HSTADDRP9"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 0" name="UOTGHS_HSTPIPCFG0" offset="0x500" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 1" name="UOTGHS_HSTPIPCFG1" offset="0x504" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
        <register caption="Host Pipe Configuration Register (n = 0) 2" name="UOTGHS_HSTPIPCFG2" offset="0x508" rw="RW" size="4">
          <bitfield caption="Pipe Memory Allocate" mask="0x00000002" name="ALLOC"/>
          <bitfield caption="Pipe Banks" mask="0x0000000C" name="PBK" values="UOTGHS_HSTPIPCFG__PBK"/>
          <bitfield caption="Pipe Size" mask="0x00000070" name="PSIZE" values="UOTGHS_HSTPIPCFG__PSIZE"/>
          <bitfield caption="Pipe Token" mask="0x00000300" name="PTOKEN" values="UOTGHS_HSTPIPCFG__PTOKEN"/>
          <bitfield caption="Automatic Switch" mask="0x00000400" name="AUTOSW"/>
          <bitfield caption="Pipe Type" mask="0x00003000" name="PTYPE" values="UOTGHS_HSTPIPCFG__PTYPE"/>
          <bitfield caption="Pipe Endpoint Number" mask="0x000F0000" name="PEPNUM"/>
          <bitfield caption="Pipe Interrupt Request Frequency" mask="0xFF000000" name="INTFRQ"/>
        </register>
